{"chat_history":"[]","question":"What does Windows 10 Provides?","ground_truth":"Windows 10 offers a variety of new features and numerous possibilities for both entertainment and productivity whether you are at school home or on the move.","context":"Windows 10 provides new features and many options for entertainment and productivity at school at home or while you re on the go To learn more about Windows; see Get started with Windows 10 on Windows.com."}
{"chat_history":"[]","question":"How much RAM does Surface Pro 4 can support?","ground_truth":"Surface Pro 4 is available with up to 16 GB of RAM.","context":"Memory and storage Surface Pro 4 is available in configurations with up to 16 GB of RAM and 512 GB storage. See Surface storage on Surface.com for info on available disk space."}
{"chat_history":"[]","question":"How do I check the battery level on my Surface Pro 4?","ground_truth":"You can check the battery level from the lock screen or the desktop taskbar. On the lock screen; the battery status appears in the lower-right corner when you wake your Surface. On the desktop taskbar; select the battery icon for info about the charging and battery status; including the percent remaining.","context":"Check the battery level You can check the battery level from the lock screen or the desktop: Lock screen. When you wake your Surface; the battery status appears in the lower-right corner of the lock screen. Desktop taskbar. Battery status appears at the right side of the taskbar. Select the battery icon for info about the charging and battery status; including the percent remaining."}
{"chat_history":"[]","question":"What processor does the Surface Pro 4 have?","ground_truth":"The Surface Pro 4 is equipped with a 6th-generation Intel Core processor; providing speed and power for smooth; fast performance.","context":"Processor The 6th-generation Intel Core processor provides speed and power for smooth; fast performance."}
{"chat_history":"[]","question":"Can I use a pen with the Surface Pro 4?","ground_truth":"Yes; the Surface Pro 4 comes with the Surface Pen; which offers a natural writing experience. You can use it to launch Cortana; open OneNote; jot down notes; or take screenshots.","context":"Surface Pen Enjoy a natural writing experience with a pen that feels like an actual pen. Use Surface Pen to launch Cortana in Windows or open OneNote and quickly jot down notes or take screenshots."}
{"chat_history":"[]","question":"How can I extend the storage on my Surface Pro 4?","ground_truth":"You can extend your storage using OneDrive; USB drives; and microSD cards.","context":"Storage and OneDrive Surface Pro 4 is available with up to 16 GB of RAM and 512 GB storage. You can extend your storage options by using OneDrive; USB drives; and microSD cards."}
{"chat_history":"[]","question":"What ports are available on the Surface Pro 4?","ground_truth":"The Surface Pro 4 has a full-size USB 3.0 port; a microSD card slot; a Mini DisplayPort; a 3.5 mm headset jack; and cover connectors for the Type Cover.","context":"Ports and connectors Surface Pro 4 has the ports you expect in a full-feature laptop. Full-size USB 3.0 port; MicroSD card slot; Mini DisplayPort version 1.2; 3.5 mm headset jack; Cover connectors."}
{"chat_history":"[]","question":"Does the Surface Pro 4 support Wi-Fi and Bluetooth?","ground_truth":"Yes; the Surface Pro 4 supports standard Wi-Fi protocols (802.11a/b/g/n/ac) and Bluetooth 4.0.","context":"Wi-Fi and Bluetooth® Surface Pro 4 supports standard Wi-Fi protocols (802.11a/b/g/n/ac) and Bluetooth 4.0."}
{"chat_history":"[]","question":"Can I use my Surface Pro 4 to take photos or record videos?","ground_truth":"Yes; the Surface Pro 4 has two cameras for taking photos and recording video: an 8-megapixel rear-facing camera with autofocus and a 5-megapixel; high-resolution; front-facing camera.","context":"Cameras Surface Pro 4 has two cameras for taking photos and recording video: an 8-megapixel rear-facing camera with autofocus and a 5-megapixel; high-resolution; front-facing camera."}
{"chat_history":"[]","question":"How do I care for the touchscreen on my Surface Pro 4?","ground_truth":"To protect the touchscreen; clean it frequently with a soft; lint-free cloth dampened with water or eyeglass cleaner; keep it covered when not in use; and avoid leaving it in direct sunlight for long periods.","context":"Touchscreen care Scratches; oil; dust; chemicals; and ultraviolet light can affect the performance of your touchscreen."}
{"chat_history":"[]","question":"Can I connect my Surface Pro 4 to a monitor or TV?","ground_truth":"Yes; you can connect your Surface Pro 4 to an HDTV; monitor; or projector using the Mini DisplayPort or wirelessly with a compatible adapter or Microsoft Wireless Display Adapter.","context":"Connect or project to a monitor; screen; or other display You can connect your Surface to a TV; monitor; or projector."}
{"chat_history":"[]","question":"Does the Surface Pro 4 come with a warranty?","ground_truth":"Yes; the Surface Pro 4 comes with a warranty. For warranty information; you can visit the Surface warranty page on Surface.com.","context":"Warranty For warranty info; see Surface warranty and Surface warranty context on Surface.com."}
{"chat_history":"[]","question":"How do I set up my Surface Pro 4?","ground_truth":"To set up your Surface Pro 4; press the power button to turn it on and then follow the Windows setup process.","context":"Set up your Surface Pro 4 Press the power button to turn on your Surface Pro 4. Windows starts and guides you through the setup process."}
{"chat_history":"[]","question":"What operating system does the Surface Pro 4 run?","ground_truth":"The Surface Pro 4 runs Windows 10 Pro operating system.","context":"Software Windows 10 Pro operating system Windows 10 provides new features and many options for entertainment and productivity at school; at home; or while you’re on the go."}
{"chat_history":"[]","question":"How can I personalize my Surface Pro 4?","ground_truth":"You can personalize your Surface Pro 4 by adjusting settings such as your account settings; lock screen; or sync settings; and by customizing the Start menu and action center.","context":"Personalization and settings Settings control nearly everything about how your Surface looks and works."}
{"chat_history":"[]","question":"How do I take care of the Type Cover for my Surface Pro 4?","ground_truth":"To clean the Type Cover; wipe it with a lint-free cloth dampened in mild soap and water. Do not apply liquids directly to the Cover.","context":"Cover and keyboard care The Type Cover for your Surface Pro 4 requires minimal care to function well."}
{"chat_history":"[]","question":"Can I install additional apps on my Surface Pro 4?","ground_truth":"Yes; you can install more apps from the Windows Store; websites; or from a CD or DVD.","context":"Get more apps Ready to get even more apps? You can install more apps and programs from the Windows Store; websites; or a CD or DVD."}
{"chat_history":"[]","question":"What accessibility features does the Surface Pro 4 have?","ground_truth":"The Surface Pro 4 offers features like Narrator; Magnifier; high contrast themes; and closed captions to make it easier to use.","context":"Accessibility Ease of Access features let you use your Surface the way you want."}
{"chat_history":"[]","question":"How do I register my Surface Pro 4 for warranty and support?","ground_truth":"To register your Surface Pro 4; go to microsoft.com/surface/support/register and sign in with your Microsoft account. You will need the serial number of your Surface Pro 4.","context":"Register your Surface If you haven’t already registered your Surface Pro 4 and other Surface products; you can do so at microsoft.com/surface/support/register."}
{"chat_history":"[]","question":"What are the camera specs on the Surface Pro 4?","ground_truth":"The Surface Pro 4 has an 8-megapixel rear-facing camera with autofocus and a 5-megapixel; high-resolution; front-facing camera. Both cameras record video in 1080p with a 16:9 aspect ratio.","context":"Cameras Surface Pro 4 has two cameras for taking photos and recording video: an 8-megapixel rear-facing camera with autofocus and a 5-megapixel; high-resolution; front-facing camera. Both cameras record video in 1080p; with a 16:9 aspect ratio."}
